import "./App.scss";
import TimeBlock from "./components/TimeBlock/TimeBlock";

const data = [
  {
    sectionTitle: "Кино",
    sectionDateStart: 1891,
    sectionDateEnd: 1990,
    sectionSlides: [
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
  {
    sectionTitle: "Кино",
    sectionDateStart: 1891,
    sectionDateEnd: 1990,
    sectionSlides: [
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
  {
    sectionTitle: "Кино",
    sectionDateStart: 1891,
    sectionDateEnd: 1990,
    sectionSlides: [
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
  {
    sectionTitle: "Кино",
    sectionDateStart: 1891,
    sectionDateEnd: 1990,
    sectionSlides: [
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
  {
    sectionTitle: "Кино",
    sectionDateStart: 1891,
    sectionDateEnd: 1990,
    sectionSlides: [
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
  {
    sectionTitle: "Кино",
    sectionDateStart: 1891,
    sectionDateEnd: 1990,
    sectionSlides: [
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        slideTitle: "1890",
        slideText:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
    ],
  },
];

function App() {
  return (
    <div className="app">
      <TimeBlock data={data} />
    </div>
  );
}

export default App;
